lemurian={'0':'Нуль',
          '1':'Адын',
          '2':'Дыва',
          '3':'Тры',
          '4':'Шатыри',
          '5':'Бядь',
          '6':'Фсефсть',
          '7':'Фсем',
          '8':'Фосем',
          '9':'Деить'}

russian={'0':'Ноль',
          '1':'Один',
          '2':'Два',
          '3':'Три',
          '4':'Четыре',
          '5':'Пять',
          '6':'Шесть',
          '7':'Семь',
          '8':'Восемь',
          '9':'Девять'}

english={'0':'Zero',
         '1':'One',
         '2':'Two',
         '3':'Three',
         '4':'Four',
         '5':'Five',
         '6':'Six',
         '7':'Seven',
         '8':'Eight',
         '9':'Nine'}

color={'1':'purple',
       '2':'blue',
       '3':'green',
       '4':'yellow',
       '5':'orange',
       '6':'red',
       '7':'pink',
       '8':'violet',
       '9':'infrared',
       '0':'ultramarine'}

